app/Controllers/Categorias.php

SELECT *
FROM `categorias`
WHERE `activo` = 1
---
    public function index($activo = 1)
    {
        $categorias = $this->categorias->where('activo', $activo)->findAll();

INSERT INTO `categorias` (`nombre`, `fecha_alta`, `fecha_edit`) VALUES ('Comida', '2024-09-18 04:00:29', '2024-09-18 04:00:29')
---
    public function insertar()
    {
        $this->categorias->save([
            'nombre' => $this->request->getPost('nombre')
        ]);

UPDATE `categorias` SET `activo` = 0, `fecha_edit` = '2024-09-18 04:01:50'
WHERE `categorias`.`id` IN ('4')
---
    public function eliminar($id)
    {
        $this->categorias->update($id, ['activo' => 0]);

SELECT *
FROM `categorias`
WHERE `activo` = 0
---
    public function eliminados($activo = 0)
    {
        $categorias = $this->categorias->where('activo', $activo)->findAll();

UPDATE `categorias` SET `activo` = 1, `fecha_edit` = '2024-09-18 04:00:38'
WHERE `categorias`.`id` IN ('4')
---
    public function reingresar($id)
    {
        $this->categorias->update($id, ['activo' => 1]);