app/Controllers/Productos.php

    public function eliminar($id)
    {
        $this->productos->update($id, ['activo' => 0]);
---
UPDATE `productos` SET `activo` = 0, `fecha_edit` = '2024-09-18 04:02:02'
WHERE `productos`.`id` IN ('2')

    public function eliminados($activo = 0)
    {
        $productos = $this->productos->where('activo', $activo)->findAll();
---
SELECT *
FROM `productos`
WHERE `activo` = 0

    public function reingresar($id)
    {
        $this->productos->update($id, ['activo' => 1]);
---
UPDATE `productos` SET `activo` = 1, `fecha_edit` = '2024-09-18 04:01:55'
WHERE `productos`.`id` IN ('4')